// 1) 
// // С помощью какого метода можно скрыть элемент?

//.hide()

// 2)
// // Создайте опработчик события для элемента ниже, который при клике будет скрывать его
// <div class="block"></div>

//$(".block").click(function(){
//$(".block").hide()
//})

// 3)
// // С помощью какого метода можно показать элемент?

//.show()

// 4)
// // Создайте опработчик события для элемента ниже, который при клике будет показывать его
// <div class="block"></div>

//$(".block").click(function(){
//     $(".block").show()
// })

// 6)
// // Установите время анимации 4s
// $(selector).show(4000);

// 6)
// // Установите время анимации 5s
// $(selector).hide(5000);


// 7)
// // Создайте опработчик события для элемента ниже, который при клике будет скрывать его, а после выводить в alert() сообщение "Скрыто"
// <div class="block"></div>
// $(".block").click(function(){
//     $(".block").hide()
//     allert("hidden")
// })



// 8)
// // Создайте опработчик события для элемента ниже, который при клике будет показывать его, а после выводить в alert() сообщение "Показано"
// <div class="block"></div>

// $(".block").click(function(){
//     $(".block").show()
//     allert("showen")
// })

// 9)
// // Создайте опработчик события для элемента ниже и наложите на него эффект с помощью fadeIn() затем письменно обьясните как он работает 
// <div class="block"></div>

// $(".block").click(function(){
//     $(".block").fadein()
// })

//метод .fadein() рфботает так что он используется для исчезновения скрываемого элемента.


// 10)
// // Создайте опработчик события для элемента ниже и наложите на него эффект с помощью fadeOut() затем письменно обьясните как он работает 
// <div class="block"></div>


// $(".block").click(function(){
//     $(".block").fadeout()
// })

//метод .fadeout() используется для исчезновения видимого элемента


// 11)
// // Создайте опработчик события для элемента ниже и наложите на него эффект с помощью fadeToggle() затем письменно обьясните как он работает 
// <div class="block"></div>

// $(".block").click(function(){
//     $(".block").fadeToggle()
// })

//метод .fadeToggle() переключается между методами fadeIn() и fadeOut()

// 12)
// // Создайте опработчик события для элемента ниже и наложите на него эффект с помощью fadeTo() затем письменно обьясните как он работает 
// <div class="block"></div>

// $(".block").click(function(){
//     $(".block").fadeTo()
// })

//метод .fadeTo() плавно переходит к заданной непрозрачности


// 13)
// // Создайте опработчик события для элемента ниже и наложите на него эффект с помощью fadeIn() затем задайте время анимации 3s
// <div class="block"></div>

// $(".block").click(function(){
//     $(".block").fadein(3000)
// })

// 14)
// // Создайте опработчик события для элемента ниже и наложите на него эффект с помощью fadeOut() затем задайте время анимации 6s
// <div class="block"></div>

// $(".block").click(function(){
//     $(".block").fadeOut(6000)
// })

// 15)
// // Создайте опработчик события для элемента ниже и наложите на него эффект с помощью fadeToggle() затем задайте время анимации 8s
// <div class="block"></div>

// $(".block").click(function(){
//     $(".block").fadeToggle(8000)
// })

// 16)
// // Создайте опработчик события для элемента ниже и наложите на него эффект с помощью fadeTo() затем задайте время анимации 10s
// <div class="block"></div>

// $(".block").click(function(){
//     $(".block").fadeTo(10000)
// })